Bwooce/tinygs_nRF52/src/main.cpp
    /* Print all unicast addresses */
    const otNetifAddress *addr = otIp6GetUnicastAddresses(inst);
    while (addr) {
        char buf[OT_IP6_ADDRESS_STRING_SIZE];
        otIp6AddressToString(&addr->mAddress, buf, sizeof(buf));
        LOG_INF("  IPv6 addr: %s", buf);
        addr = addr->mNext;
    }
}

static void log_ot_diagnostics(void)
{
    struct openthread_context *ctx = openthread_get_default_context();
    openthread_api_mutex_lock(ctx);
    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

static void joiner_callback(otError error, void *context)
{
    if (error == OT_ERROR_NONE) {
        LOG_INF("=== Joiner succeeded! Starting Thread... ===");
        struct openthread_context *ctx = openthread_get_default_context();
        otIp6SetEnabled(ctx->instance, true);
        otThreadSetEnabled(ctx->instance, true);
    } else {
        LOG_ERR("Joiner failed: %d", (int)error);
    }
}

static void init_openthread(void)
{
    struct openthread_context *ctx = openthread_get_default_context();

    LOG_INF("Starting OpenThread (Joiner mode)...");
    openthread_state_changed_cb_register(ctx, &ot_state_cb);
    openthread_start(ctx);

    k_msleep(500);

    openthread_api_mutex_lock(ctx);
    otInstance *inst = ctx->instance;

    /* Check if we already have a valid dataset (from a previous successful join) */
    otOperationalDataset dataset;
    otError err = otDatasetGetActive(inst, &dataset);

    if (err == OT_ERROR_NONE && dataset.mComponents.mIsNetworkKeyPresent) {
        LOG_INF("Found existing dataset — attaching directly");
        dump_ot_dataset(ctx);
        otIp6SetEnabled(inst, true);
        otThreadSetEnabled(inst, true);
    } else {
        LOG_INF("No valid dataset — starting Joiner with PSKd");
        otIp6SetEnabled(inst, true);

        err = otJoinerStart(inst,
                            CONFIG_OPENTHREAD_JOINER_PSKD,  /* PSKd */
                            NULL,   /* provisioning URL */
                            NULL,   /* vendor name */
                            NULL,   /* vendor model */
                            NULL,   /* vendor sw version */
                            NULL,   /* vendor data */
                            joiner_callback, NULL);

        if (err != OT_ERROR_NONE) {
            LOG_ERR("otJoinerStart failed: %d", (int)err);
        } else {
            LOG_INF("Joiner started, waiting for commissioner (PSKd: %s)...",
                    CONFIG_OPENTHREAD_JOINER_PSKD);
        }
    }

    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

/* -------------------------------------------------------------------------- */
/* DNS Resolution via OpenThread DNS client (NAT64)                            */
/* -------------------------------------------------------------------------- */

static K_SEM_DEFINE(dns_sem, 0, 1);
static volatile int dns_result = -1;

static void dns_callback(otError aError, const otDnsAddressResponse *aResponse, void *aContext)
{
    if (aError != OT_ERROR_NONE) {
        LOG_ERR("OT DNS callback error: %d", (int)aError);
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    otIp6Address addr;
    uint32_t ttl;
    otError err = otDnsAddressResponseGetAddress(aResponse, 0, &addr, &ttl);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("OT DNS no address in response: %d", (int)err);
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    /* Store resolved address into broker_addr */
    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;
    memset(sin6, 0, sizeof(*sin6));
    sin6->sin6_family = AF_INET6;
    sin6->sin6_port = htons(MQTT_BROKER_PORT);
    memcpy(&sin6->sin6_addr, &addr, sizeof(addr));

    char addr_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&addr, addr_str, sizeof(addr_str));
    LOG_INF("Resolved %s -> [%s]:%d (TTL=%u)",
            MQTT_BROKER_HOSTNAME, addr_str, MQTT_BROKER_PORT, (unsigned)ttl);

    dns_result = 0;
    k_sem_give(&dns_sem);
}

static int resolve_broker(void)
{
    struct openthread_context *ctx = openthread_get_default_context();

    LOG_INF("Resolving %s via OT DNS...", MQTT_BROKER_HOSTNAME);

    k_sem_reset(&dns_sem);
    dns_result = -1;

    /*
     * Use otDnsClientResolveIp4Address with our BR's DNS config.
     * The default config may use another BR's DNS (router f800) which
     * synthesizes NAT64 addresses using a prefix that f800 doesn't
     * actually translate. Force use of our HA SkyConnect BR's DNS proxy.
     */
    openthread_api_mutex_lock(ctx);

    /* Get the default config as a starting point, then override the NAT64 mode */
    otDnsQueryConfig config;
    const otDnsQueryConfig *defaultConfig = otDnsClientGetDefaultConfig(ctx->instance);
    config = *defaultConfig;
    config.mNat64Mode = OT_DNS_NAT64_ALLOW;

    /*
     * Connect via socat proxy on the HA Border Router.
     * The HA OTBR addon doesn't have OT_NAT64_TRANSLATOR compiled in,
     * so NAT64 translation doesn't work. Workaround: socat on HA bridges
     * Thread IPv6 port 18883 → mqtt.tinygs.com:8883 IPv4.
     *
     * BR mesh-local RLOC: fd69:9a4f:1982::ff:fe00:2c00
     * TODO: Replace with proper NAT64 when HA fixes their OTBR addon.
     */
    otIp6Address brAddr;
    memset(&brAddr, 0, sizeof(brAddr));
    /* fd9f:2193:7da6:1:30f0:ebe1:3aa:b659 — BR's stable mesh-local EID */
    brAddr.mFields.m16[0] = htons(0xfd9f);
    brAddr.mFields.m16[1] = htons(0x2193);
    brAddr.mFields.m16[2] = htons(0x7da6);
    brAddr.mFields.m16[3] = htons(0x0001);
    brAddr.mFields.m16[4] = htons(0x30f0);
    brAddr.mFields.m16[5] = htons(0xebe1);
    brAddr.mFields.m16[6] = htons(0x03aa);
    brAddr.mFields.m16[7] = htons(0xb659);

    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;
    memset(sin6, 0, sizeof(*sin6));
    sin6->sin6_family = AF_INET6;
    sin6->sin6_port = htons(MQTT_PROXY_PORT);
    memcpy(&sin6->sin6_addr, &brAddr, sizeof(brAddr));

    char addr_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&brAddr, addr_str, sizeof(addr_str));
    LOG_INF("Using socat proxy: [%s]:%d -> mqtt.tinygs.com:8883",
            addr_str, MQTT_PROXY_PORT);

    openthread_api_mutex_unlock(ctx);
    return 0;
}

